# FamilyNotFitHostShape Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..FamilyNotFitHostShape Property
BuiltInFailures..::..FamilyFailures Class See Also
---
The host shape has changed and the family is no longer appropriate.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FamilyNotFitHostShape { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FamilyNotFitHostShape As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FamilyNotFitHostShape {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace